Welcome to the 3rd intro to python notebook

Last time you learned dictionaries, how to open txt files, and classes

In [ ]:
#You now know many of the fundamentals of python


#check over this list. Now is a good time to review 
#if you missed any of these or don't remember them

#python

# if/elif/else
#indexing and slicing
# for loop
# for loops with range()
# functions/methods
# custom functions
# ((classes))

####datatypes
# list
# dict

# tuple
# str
# int
# float
# bool

In [1]:
# btw there are also while loops


#while loops

#no reason to use a while loop if you can help it

#if you are not sure when a loop will stop use while

count=0

while count < 3:
    print(count)
    count+=1

0
1
2

In [4]:
#contrast that with this

for i in range(0,3,1):
    i+=1
    print(i)

1
2
3

In [5]:
#more fun with while loops

word = input('hello')

while word != 'quit':
    #process word
    print(word.upper())
    word = input('enter a word, I print uppercase')

hellohello
HELLO
enter a word, I print uppercasesallysoo
SALLYSOO
enter a word, I print uppercasewoohoo
WOOHOO
enter a word, I print uppercasequit

In [6]:
#more fun with while loops

message = 'enter a word and ill uppercase it'

printing_words = True #you can set loop on and off this way

while printing_words:
    word = input(message)
    if word != 'quit':
        print(word.upper())
    else:
        printing_words=False

enter a word and ill uppercase ithell
HELL
enter a word and ill uppercase ithell
HELL
enter a word and ill uppercase ithello
HELLO
enter a word and ill uppercase ittypos
TYPOS
enter a word and ill uppercase itomg
OMG
enter a word and ill uppercase itquit

In [7]:
#similar solution
message = 'enter a word and ill uppercase it'


while True: #loop forever
    word = input(message)
    if word != 'quit':
        print(word.upper())
    else:
        break

enter a word and ill uppercase itheehee
HEEHEE
enter a word and ill uppercase ityeehaw
YEEHAW
enter a word and ill uppercase itquit

#*$*$SIRENS HORNS FANFAR #*(*#($*


Let's talk about importing libraries

This is where things get pretty fun

Libraries are packages you can import that have all kinds of fun and unique functions

We have done this a little bit so far with the collections library

There are SO MANY libraries with lots of cool specialized purposes, from 
basic math to astrophysics

In [ ]:
#to import a library, just put import and the libraries name at the top of your code

#you have to run it in the beginning of your script every single time 

#importing is NOT like installing

#every time you want to use a library, you have to import it

In [8]:
#here's a fun library

import random

In [ ]:
#let's create a random number 
secret_num = random.randint(1,20) #random is the library name, 
#randint is the thing you are using

Can you write a program that looks for the secret number?

You can use a while loop
And the input function to have the user guess the secret number

Don't forget to start by importing random

Solution/spoilers before

Try to solve before looking at soluction

In [9]:
import random

secret_num = random.randint(1,20)

number_not_found = True

numbers_tried = []

while number_not_found:
    number = float(input('type a number between 1 and 20 '))
    if number == secret_num:
        print('you found the secret number')
        number_not_found=False
        break
    elif number > secret_num:
        print('guess lower')
        numbers_tried.append(float(number))
    elif number < secret_num:
        print('guess higher')
        numbers_tried.append(float(number))
        
print(numbers_tried)
print('The secret number was: ', secret_num)

type a number between 1 and 20 6
guess higher
type a number between 1 and 20 9
guess lower
type a number between 1 and 20 8
you found the secret number
[6.0, 9.0]
The secret number was:  8

The important libraries for data analysis are numpy, pandas, and matplotlib

In [ ]:
#working with numpy and pandas

#the data science standard imports
import numpy as np #less annoying to type 
import pandas as pd
import matplotlib as plt
%matplotlib inline

You do need to install them to get started

In [10]:
pip list #this shows you what you already have installed

Package            Version
------------------ ------------
appnope            0.1.0
astropy            4.0.3
attrs              19.3.0
backcall           0.1.0
bleach             3.1.2
certifi            2020.6.20
chardet            3.0.4
cycler             0.10.0
decorator          4.4.2
defusedxml         0.6.0
entrypoints        0.3
graphviz           0.14
idna               2.10
ipykernel          5.1.4
ipython            7.13.0
ipython-genutils   0.2.0
ipywidgets         7.5.1
jedi               0.16.0
Jinja2             2.11.1
joblib             0.14.1
jsonschema         3.2.0
jupyter            1.0.0
jupyter-client     6.0.0
jupyter-console    6.1.0
jupyter-core       4.6.3
kiwisolver         1.1.0
MarkupSafe         1.1.1
matplotlib         3.2.0
mistune            0.8.4
nbconvert          5.6.1
nbformat           5.0.4
notebook           6.0.3
numpy              1.18.1
oauthlib           3.1.0
pandas             1.0.2
pandocfilters      1.4.2
parso              0.6.2
pexpect            4.8.0
pickleshare        0.7.5
pip                19.2.3
prometheus-client  0.7.1
prompt-toolkit     3.0.4
ptyprocess         0.6.0
Pygments           2.6.1
pyparsing          2.4.6
pyrsistent         0.15.7
PySocks            1.7.1
python-dateutil    2.8.1
pytz               2019.3
pyzmq              19.0.0
qtconsole          4.7.1
QtPy               1.9.0
requests           2.24.0
requests-oauthlib  1.3.0
scikit-learn       0.22.2.post1
scipy              1.4.1
seaborn            0.10.1
Send2Trash         1.5.0
setuptools         41.2.0
six                1.14.0
terminado          0.8.3
testpath           0.4.4
tornado            6.0.4
traitlets          4.3.3
tweepy             3.9.0
urllib3            1.25.10
wcwidth            0.1.8
webencodings       0.5.1
widgetsnbextension 3.5.1
WARNING: You are using pip version 19.2.3, however version 20.3 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [ ]:
##if you want to install other libraries
#pip install library_name
##to see what libraries are installed already
#pip list

In [11]:
! pip3 install pandas #you can use pip install
# ! pip install pandas #this might work better for you, sometimes there are differences
#on different computers


#mine says its already installed, for you this should trigger install process

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (1.0.2)
Requirement already satisfied: pytz>=2017.2 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (2019.3)
Requirement already satisfied: numpy>=1.13.3 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (1.18.1)
Requirement already satisfied: python-dateutil>=2.6.1 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages (from python-dateutil>=2.6.1->pandas) (1.14.0)
WARNING: You are using pip version 19.2.3, however version 20.3 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [7]:
#you'll need to import every time you want to run a script
#though once per notebook is fine as long as you run that cell

import numpy as np #less annoying to type 
import pandas as pd
import matplotlib as plt
%matplotlib inline

Numpy

Numpy is a library that is really efficient at doing math

It is good for data analysis when you deal with big data sets

Small increases in efficency matter a lot the more data you are using

Numpy is often used for making arrays

In [13]:
#say we have a list of values

values =[2,2,4,5,2]


#and we want to turn it into an array

arr=np.array(values) #np is numpy, we imported as abbreviation, array is what you are using

print(arr)
print(type(arr))

[2 2 4 5 2]
<class 'numpy.ndarray'>

In [14]:
arr.dtype

#arrays are not the same as lists, you can think of this as a more precise and efficent
#way of manipulating data

dtype('int64')

In [16]:
#in some ways manipulating them is the same
arr *10

print(arr)

[2 2 4 5 2]

In [17]:
#though if oyu want to add to arrays it needs to match in length
arr +[1,2,3,3,50] #has to be same length

array([ 3,  4,  7,  8, 52])

In [18]:
print(arr) #original is unchanged cause we didnt save it

[2 2 4 5 2]

In [20]:
#lots of fun methods for arrays

#remember methods are object.method()

#methods

arr.mean() #get the mean of the array

arr.std() #gets the standard deviation of the array (remember error bars???)

arr.argmax() #index location for highest value

print(arr.mean()) 

print(arr.std()) 

print(arr.argmax())

3.0
1.2649110640673518
3

Pandas

Pandas will help you make your data into data frames

In [5]:
#remember how we made a dictionary of sat scores


df={

}

df['SAT_math']=[500,400,300,800]
df['SAT_verbal']=[700,7000,700,600]

df['SAT_math']

[500, 400, 300, 800]

In [8]:
#we could make this a dataframe

df = pd.DataFrame() #make an empty df with pandas
df

Empty DataFrame
Columns: []
Index: []

In [9]:
#manually create by putting lists

df['SAT_math']=[500,400,300,800]
df['SAT_verbal']=[700,7000,700,600]

df #this is so pretty!!! Look at how different the printout is!!

   SAT_math  SAT_verbal
0       500         700
1       400        7000
2       300         700
3       800         600

In [25]:
df.head(2) #this method gives you a little snapshot

   SAT_math  SAT_verbal
0       500         700
1       400        7000

In [26]:
#structure of the dataframe

#each column is a series

type(df['SAT_math'])

pandas.core.series.Series

In [27]:
df['SAT_math']

0    500
1    400
2    300
3    800
Name: SAT_math, dtype: int64

In [28]:
df['SAT_math'][0] #get value at spot 0

500

In [29]:
df['SAT_math'].value_counts() #this returns another series
#of information about your pandas series

800    1
500    1
300    1
400    1
Name: SAT_math, dtype: int64

In [30]:
df['SAT_math'].value_counts()[400]

1

In [33]:
pd.Series.value_counts() #shift tab in () to get help
#pd.Series.value_counts(abs) #this is the first auto complete offered by shift tabbing inside the ()

In [ ]:
#guideline for pandas!!


#theres a bunch of methods for df
#theres a bunch of methods for series

#most of the time you will get 1 or 3 things returned
#pandas almost always return:
#1. dataframe (df)
#2. series
#3. some individual value

In [34]:
df['SAT_math'].mean() #method!

500.0

In [35]:
df['SAT_math']*1000

0    500000
1    400000
2    300000
3    800000
Name: SAT_math, dtype: int64

let's make a new column in our df

we want to have a total sat score

Can you insert a new column into the df that is the total score?

Caution

In [ ]:
Solution below

Seriously

Try first

Try

Try

In [12]:
df['Total']=df["SAT_math"]+df['SAT_verbal']
df

   SAT_math  SAT_verbal  Total
0       500         700   1200
1       400        7000   7400
2       300         700   1000
3       800         600   1400

In [13]:
#if you regret adding it, there is a method to drop

df.drop('Total',axis=1) #axis 0, row axis 1 = columns

   SAT_math  SAT_verbal
0       500         700
1       400        7000
2       300         700
3       800         600

In [42]:
df

   SAT_math  SAT_verbal
0       500         700
1       400        7000
2       300         700
3       800         600

In [14]:
#you can overwrite

df=df.drop("Total", axis=1)

In [15]:
df

   SAT_math  SAT_verbal
0       500         700
1       400        7000
2       300         700
3       800         600

In [16]:
df['Total']=df["SAT_math"]+df['SAT_verbal']

In [17]:
df

   SAT_math  SAT_verbal  Total
0       500         700   1200
1       400        7000   7400
2       300         700   1000
3       800         600   1400

In [ ]:
#there is also an apply method

#good for doing something to a whole series

In [48]:

df['SAT_math'].apply(float)

0    500.0
1    400.0
2    300.0
3    800.0
Name: SAT_math, dtype: float64

In [49]:
df

   SAT_math  SAT_verbal  Total
0       500         700   1200
1       400        7000   7400
2       300         700   1000
3       800         600   1400

In [18]:

# we can even use our irrelevant custom functions from before lololol

def cel_to_f(c):
    
    return c*(9/5)+32
    
    
df['SAT_math'].apply(cel_to_f)

0     932.0
1     752.0
2     572.0
3    1472.0
Name: SAT_math, dtype: float64

In [55]:
#what if you want to look at certain rows that
#match particular critera


masl = df['SAT_math'] >600

In [57]:
x=df[masl]
x

   SAT_math  SAT_verbal  Total
3       800         600   1400

In [54]:
print(masl)

0    False
1    False
2    False
3     True
Name: SAT_math, dtype: bool

In [19]:
#and looks a little different 

# & and

# | #this is your dude now


mask=(df['SAT_math'] >= 600) | (df['SAT_verbal']>=600)
mask

0    True
1    True
2    True
3    True
dtype: bool

In [60]:
df_high=df[masl]
df_high

   SAT_math  SAT_verbal  Total
3       800         600   1400

In [61]:
df

   SAT_math  SAT_verbal  Total
0       500         700   1200
1       400        7000   7400
2       300         700   1000
3       800         600   1400

Let's combine what we learned about opening and manipulating data last time


With pandas dataframes

You'll need to download the chipotle.csv file from github

a csv file is a great data format, you can open it in basically anything

Always save data as csv files

Pandas has a read csv command you can use

In [20]:
df=pd.read_csv('chipotle.csv') #let's use it to make a data frame

In [63]:
df.head() #take a peek

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [65]:
df.columns #here are the columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [67]:
df['item_price']

0        $2.39
1        $3.39
2        $3.39
3        $2.39
4       $16.98
         ...
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
4621     $8.75
Name: item_price, Length: 4622, dtype: object

In [68]:
df.info() #useful info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

Let's do some exercises


Question 1: How many orders (rows) were for $10.00 or more?

Question 2: Can you sort the Dataframe by the item_name (just to practice learning how to use methods)

Question 3: For the order that cost the most money, what is the quantity in that row?

Question 4: How many times was the Veggie Salad Bowl ordered?

Question 5: How many times did people order more than one Canned Soda?

Pro tip 

Before you can do data analysis you will need to clean the data.  

There is often a ton of random stuff in there, or things aren't in the right format

Can you first come up with a list of problems in the data set that will prevent you find solving the questions?

Some problems to consider.....

problem 1:
    
The price is not a number and has non numerical characters

Can you write a function that strips out the $ and converts 
the price into a number?

In [71]:
#If you are stuck at first try to just do it with a random price
#rather than the dataframe

price='2.34'
price

'2.34'

Ok a solution for the random price function below

spoilers below

In [ ]:
spoilers below

In [26]:
def remove(string):
    for v in string:
        string = string.replace('$',' ')
    return float(string)

In [74]:
string=remove(price)
        
print(string)
type(string)

2.34

float

Can you do it for the df?

In [27]:
def remove(string):
    for v in string:
        string = string.replace('$',' ')
      #  string= float(string)
    return float(string)

In [28]:
temp=df['item_price'].apply(remove) #apply your custom function to this
temp

0        2.39
1        3.39
2        3.39
3        2.39
4       16.98
        ...
4617    11.75
4618    11.75
4619    11.25
4620     8.75
4621     8.75
Name: item_price, Length: 4622, dtype: float64

In [29]:
#you can also add the cleaned price column to the df
df['price']=df['item_price'].apply(remove)
df

,order_id,quantity,item_name,choice_description,item_price,price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
...,...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75,8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75,8.75

Cool cool, you've cleaned the data

Now answer question #1 

How many orders (rows) were for $10.00 or more?

Spoilers below

Spoilers below, try on your own first!

In [30]:
pricey_item=(df['price'] >= 10)

In [83]:
pricey_item.count()

4622

In [81]:
len(pricey_item)

4622

Good job!

Now for Question 2

Sort the Dataframe by the item_name 
(just to practice learning how to use methods)

There is a sort_values method

try it out!

In [ ]:
Spoilers below

In [ ]:
Spoilers below

In [ ]:
Spoilers below

In [ ]:
Spoilers below

In [23]:
df2=df.sort_values(by=["item_name"])

In [86]:
df2.head()

,order_id,quantity,item_name,choice_description,item_price,price
3389,1360,2,6 Pack Soft Drink,[Diet Coke],$12.98,12.98
341,148,1,6 Pack Soft Drink,[Diet Coke],$6.49,6.49
1849,749,1,6 Pack Soft Drink,[Coke],$6.49,6.49
1860,754,1,6 Pack Soft Drink,[Diet Coke],$6.49,6.49
2713,1076,1,6 Pack Soft Drink,[Coke],$6.49,6.49

In [87]:
len(df2) #make sure you didn't lose anything

4622

In [31]:
#more fun methods

# max will find the max!

#let's make the pricey items their own df

mask=(df['price'] >= 10)
df_bigmoney = df[mask]
df_bigmoney

,order_id,quantity,item_name,choice_description,item_price,price
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98,10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75,11.75
13,7,1,Chicken Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",$11.25,11.25
23,12,1,Chicken Burrito,"[[Tomatillo-Green Chili Salsa (Medium), Tomati...",$10.98,10.98
...,...,...,...,...,...,...
4610,1830,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,11.75
4611,1830,1,Veggie Burrito,"[Tomatillo Green Chili Salsa, [Rice, Fajita Ve...",$11.25,11.25
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75,11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75,11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25,11.25

In [92]:
df_bigmoney.count()

order_id              1130
quantity              1130
item_name             1130
choice_description    1123
item_price            1130
price                 1130
dtype: int64

In [93]:

len(df_bigmoney)

1130

In [94]:
df_bigmoney.max()

order_id                   1834
quantity                     15
item_name     Veggie Soft Tacos
item_price              $44.25
price                     44.25
dtype: object

Question 3: For the order that cost the most money,
what is the quantity in that row?

Spoilers below

Spoilers below

In [32]:
df_bigmoney.max()['quantity']

15

Question 4: How many times was the Veggie Salad Bowl ordered?

In [96]:
#lets look at salads

saladmask=(df['item_name'] == 'Veggie Salad Bowl')

df_salad = df[saladmask]

len(df_salad)

18

In [97]:
df_salad.head

<bound method NDFrame.head of       order_id  quantity          item_name  \
186         83         1  Veggie Salad Bowl
295        128         1  Veggie Salad Bowl
455        195         1  Veggie Salad Bowl
496        207         1  Veggie Salad Bowl
960        394         1  Veggie Salad Bowl
1316       536         1  Veggie Salad Bowl
1884       760         1  Veggie Salad Bowl
2156       869         1  Veggie Salad Bowl
2223       896         1  Veggie Salad Bowl
2269       913         1  Veggie Salad Bowl
2683      1066         1  Veggie Salad Bowl
3223      1289         1  Veggie Salad Bowl
3293      1321         1  Veggie Salad Bowl
4109      1646         1  Veggie Salad Bowl
4201      1677         1  Veggie Salad Bowl
4261      1700         1  Veggie Salad Bowl
4541      1805         1  Veggie Salad Bowl
4573      1818         1  Veggie Salad Bowl

                                     choice_description item_price  price
186   [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...    $11.25   11.25
295   [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...    $11.25   11.25
455   [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...    $11.25   11.25
496   [Fresh Tomato Salsa, [Rice, Lettuce, Guacamole...    $11.25   11.25
960   [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...     $8.75    8.75
1316  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...     $8.75    8.75
1884  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...    $11.25   11.25
2156  [Tomatillo Red Chili Salsa, [Fajita Vegetables...    $11.25   11.25
2223      [Roasted Chili Corn Salsa, Fajita Vegetables]     $8.75    8.75
2269  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...     $8.75    8.75
2683  [Roasted Chili Corn Salsa, [Fajita Vegetables,...     $8.75    8.75
3223  [Tomatillo Red Chili Salsa, [Fajita Vegetables...    $11.25   11.25
3293  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...     $8.75    8.75
4109  [Tomatillo Red Chili Salsa, [Fajita Vegetables...    $11.25   11.25
4201  [Fresh Tomato Salsa, [Fajita Vegetables, Black...    $11.25   11.25
4261  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...    $11.25   11.25
4541  [Tomatillo Green Chili Salsa, [Fajita Vegetabl...     $8.75    8.75
4573  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...     $8.75    8.75  >

In [98]:
keep = ['choice_description', 'price'] #maybe we want 
#to get rid of extra stuff
df_salad[keep]

                                     choice_description  price
186   [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...  11.25
295   [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...  11.25
455   [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...  11.25
496   [Fresh Tomato Salsa, [Rice, Lettuce, Guacamole...  11.25
960   [Fresh Tomato Salsa, [Fajita Vegetables, Lettu...   8.75
1316  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...   8.75
1884  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...  11.25
2156  [Tomatillo Red Chili Salsa, [Fajita Vegetables...  11.25
2223      [Roasted Chili Corn Salsa, Fajita Vegetables]   8.75
2269  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...   8.75
2683  [Roasted Chili Corn Salsa, [Fajita Vegetables,...   8.75
3223  [Tomatillo Red Chili Salsa, [Fajita Vegetables...  11.25
3293  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...   8.75
4109  [Tomatillo Red Chili Salsa, [Fajita Vegetables...  11.25
4201  [Fresh Tomato Salsa, [Fajita Vegetables, Black...  11.25
4261  [Fresh Tomato Salsa, [Fajita Vegetables, Rice,...  11.25
4541  [Tomatillo Green Chili Salsa, [Fajita Vegetabl...   8.75
4573  [Fresh Tomato Salsa, [Fajita Vegetables, Pinto...   8.75

Can you write a script that looks through the item names
And finds the veggie salad bowls and counts them up?

In [ ]:
Spoilers

In [ ]:
Spoilers

In [ ]:
Spoilers

In [ ]:
Spoilers

In [99]:
veggieTeller = 0
for i in df.item_name:
    if i == "Veggie Salad Bowl":
        veggieTeller += 1
print(veggieTeller)

18

Question 5: How many times did people order more than one Canned Soda?

Spoilers

Spoilers

Spoilers

In [33]:
sodamask=((df['item_name'] == 'Canned Soda') & (df['quantity'] >1))
df_soda = df[sodamask] 
df_soda
len(df_soda)

20

In [34]:
df.head()
len(df)

4622

Amazing work, you are so talented

Perhaps you'd like to save all of your hard work?

In [35]:
#how to save df as a csv file on your computer


#df have methods for saving stuff
#df.to_csv()
df.to_csv('chipotle_clean.csv',index=False) #get rid of 1st index

In [36]:
hello=pd.read_csv('chipotle_clean.csv')
hello.head()

,order_id,quantity,item_name,choice_description,item_price,price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39,2.39
1,1,1,Izze,[Clementine],$3.39,3.39
2,1,1,Nantucket Nectar,[Apple],$3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98,16.98